--------------------------------------------------------------------------------
-- Кастомная конфигурация для var_dump
-- https://github.com/Alfa-ao/var_dump
--------------------------------------------------------------------------------
Global( "__CONFIG_VAR_DUMP", {
    DEBUG = {
        disableBacktrace = true, -- Отключает вывод структуры вызовов (стэк-трейс)
    },
    WIDGET = {
        GetNamedChildren = false, -- false: Использовать только имена, иначе может забить весь лог до ограничения
    }
} )

--------------------------------------------------------------------------------
-- Настройки самого Аддона
--------------------------------------------------------------------------------
Global( "CONFIG", {
    
    ---------------------------------------------
    -- Ограничения отображения
    ---------------------------------------------
    
    MAX_DISPLAY_RESULTS = 6,       -- Максимальное количество строк для отображения ТОП-N рецептов.
    DEFAULT_MAX_CORRECTIONS = 6,   -- Максимальное значение коррекции в барабане.

    ---------------------------------------------
    -- Типы отображаемых сообщений
    ---------------------------------------------
    
    MESSAGE_NORMAL = 0,            -- Обычный режим отображения.
    MESSAGE_GREETINGS = 1,         -- Сообщение при первом входе персонажа в игру "Приветствую!".
    MESSAGE_WELCOME_BACK = 2,      -- Сообщение при повторном открытии окна алхимии "С возвращением!".

    ---------------------------------------------
    -- AlchemyV2
    ---------------------------------------------
    
    ENABLE_CUSTOM_LAYOUT = true,   -- Флаг использования кастомного стиля окна с барабанами для Алхимии.
                                   -- false - стандартный стиль игры. 

    ---------------------------------------------
    -- Отладка и логирование
    ---------------------------------------------
    
    DEBUG = false,                 -- Включить общее логирование работы аддона (категория GENERAL).
    DEBUG_REACTION = false,        -- Включить расширенное логирование реакций (категория REACTION).
    
    ---------------------------------------------
    -- Логика.
    ---------------------------------------------
    
    REQUIRED_COMPONENTS_COUNT = false, -- Количество заполненных слотов должно совпадать с требуемым кол-вом компонентов.
                                       -- true - Строгость. Игнорирует зелья те, у которых слотов меньше или больше.
    
    ---------------------------------------------
    -- Для common.DelayedCall. Значение не менять!!
    ---------------------------------------------
	
    DELAY_MS_UPDATE = 100,
    
    ---------------------------------------------
    -- GUI позиция, размещения, отступы
    ---------------------------------------------
	
    GUI = {
        POS_X = -100, -- Сдвиг по оси X.
        SIZE_Y = 770, -- Размер AlchemyV2 на главном меню.
        PADDING = 15, -- Отступ со всех сторон от края.
        CONTAINER_SIZE_X = 533,
        
        -- AlchemyV2
        ACTION_UP_POS_Y = 308,
        ROLL_TUBE_EXTRA_SIZE = 342,
        BAR_EXTRA_SIZE = 440,
        CORRECTION_COUNT_EXTRA_SIZE = 30,
        ROLLS_EXTRA_SIZE = 26,
        ROLLS_HIGH_POS_Y_OFFSET = 15,
    },
    
    ---------------------------------------------
    -- DND
    ---------------------------------------------
	
    DND = {
        SAVE = true,  -- сохранять позицию подсказки.
        CURSOR = nil, --"drag",
    },
} )